encoding(utf8).

любит("Таня", яблоки).
любит("Сергей", бананы).
любит("Андрей", яблоки).
любит("Света", карамель).
любит("Вова", карамель).
любит("Таня", халва).
любит("Света", апельсины).
любит("Вова", бананы).

любит_бананы(Х) :- 
  любит(Х, бананы).

любит_халву_и_яблоки(Х) :- 
  любит(Х, халва), любит(Х, яблоки).

что_любит_Вова(Х) :-
  любит("Вова", Х).

что_любят_Света_и_Вова(Х) :-
  любит("Вова", Х), любит("Света", Х).


main :- 
  write("Ваня любит: "), findall(Х0, что_любит_Вова(Х0), С0), writeln(С0),
  write("Халву и яблоки любят: "), findall(Х1, любит_халву_и_яблоки(Х1), С1), writeln(С1),
  write("Вова любит: "), findall(Х2, что_любит_Вова(Х2), С2), writeln(С2),
  write("Света и Вова любят: "), findall(Х3, что_любят_Света_и_Вова(Х3), С3), writeln(С3).